package com.showapi.service.entity;

import java.util.List;

/**
 * Created by song on 2017/2/23.
 * Email：815464927@qq.com
 */

public class JokeText {

    /**
     * showapi_res_code : 0
     * showapi_res_error :
     * showapi_res_body : {"allPages":811,"ret_code":0,"contentlist":[{"id":"58ae516e6e36386e8c845f7c","title":"\u201c你电脑里的小说是在...","text":"\u201c你电脑里的小说是在哪下载的，看着真TM带劲！\u201d\r\n\u201c那特么是我日记。\u201d","type":1,"ct":"2017-02-23 11:05:18.161"},{"id":"58ae49416e36386e8c8434e4","title":"某电视台做一期关于单...","text":"某电视台做一期关于单身节目，记者采访了一单身男\r\n记者：\u201c请问单身是什么感觉？\u201d\r\n某男：\u201c你有女朋友吗？\u201d\r\n记者：\u201c还没。\u201d\r\n某男：\u201c那你TM还问我？\u201d\r\n记者：\u201c\u2026\u2026\u201d\r\n记者：\u201c但是我有男朋友啊！\u201d\r\n某男：\u201c噢噢，那没事了\u2026\u2026\u201d","type":1,"ct":"2017-02-23 10:30:25.388"},{"id":"58ae434f6e36386e8c842c00","title":"丽丽：\u201c妈妈我是你生...","text":"丽丽：\u201c妈妈我是你生的吗？\u201d\r\n母亲：\u201c是呀，宝贝儿。\u201d\r\n丽丽：\u201c那我哥哥是谁生的呢？\u201d\r\n母亲：\u201c傻孩子，你哥哥当然也是我生的呀。\u201d\r\n丽丽：\u201c连男孩也是妈妈生的，那要爸爸有啥用呢？\u201d\r\n","type":1,"ct":"2017-02-23 10:05:03.468"},{"id":"58ae352b6e36386e8c83f663","title":"晚上和媳妇聊天，媳妇...","text":"晚上和媳妇聊天，媳妇问我：什么是真爱？\r\n我：真爱就是，我不嫌你丑，你不嫌我瞎。\r\n媳妇：哦，看老娘不打死你！！","type":1,"ct":"2017-02-23 09:04:43.031"},{"id":"58ae352b6e36386e8c83f662","title":"一男相亲，女的问他：...","text":"一男相亲，女的问他：\u201c你喜欢一见钟情呢还是日久生情呢？\u201d\r\n他说：\u201c我喜欢一炮而红的。。。。。\u201d","type":1,"ct":"2017-02-23 09:04:43.031"},{"id":"58ae27016e36386e8c83c7b7","title":"今天看到女神在线。\r...","text":"今天看到女神在线。\r\n我发了一个信息给她：\u201c在吗？\u201d\r\n十分钟后女神回道：\u201c在拉，有事吗？\u201d\r\n天哪！女神居然回复我了！\r\n我按耐住激动的心情回复：\u201c那你先拉，拉完再聊。\u201d\r\n一个小时过去了，女神怎么还没拉完？","type":1,"ct":"2017-02-23 08:04:17.523"},{"id":"58ad5a236e36386e8c80ec46","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1，一打开电视总是会碰到广告，一打起瞌睡总是遇到主管。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2，选老板和选老婆一样，和你当初的梦想差了十万八千里。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3，现代人的迷思在于：你要做大公司里的小职员还是小公司里的大职员？<p><\/p>\r\n4，发财是每个上班族的梦想，发呆是每个上班族的心愿。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5，当老板告诉你退一步海阔天空的时候，你最好提防后面是不是断崖。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6，成功的男人背后一定有一个伟大的女人，成功的老板背后一定有一群倒霉的员工。\r\n\t<\/p>\r\n\t<p>\r\n\t\t7，时间就是金钱，但一个人没找到工作前，时间可一点都不值钱。\r\n\t<\/p>\r\n\t<p>\r\n\t\t8，文件是做不完的，我们的青春是会消耗完的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t9，职员写日记，老板写传记.\r\n\t<\/p>\r\n\t<p>\r\n\t\t10，上天要毁灭一个人，会先让他成为上班族，然后再让他的老板把他搞疯。\r\n\t<\/p>\r\n\t<p>\r\n\t\t11，人没有办法同时赚钱又同时花钱，所以我们需要一个老婆\u2014\u2014上班族老公如是说。\r\n\t<\/p>\r\n\t<p>\r\n\t\t12，两点间最远的距离就是职员与老板对看的距离。\r\n\t<\/p>\r\n\t<p>\r\n\t\t13，天下没有愚蠢的员工，只有装傻的员工。\r\n\t<\/p>\r\n\t<p>\r\n\t\t14，在现代公司里，能者不是多劳而是脱逃。\r\n\t<\/p>\r\n\t<p>\r\n\t\t15，下班第一杯啤酒，消除你一天的紧张。下班第二杯啤酒，消除你一天的不满。下班第三杯啤酒，消除你一天的无奈。其余的啤酒，消除你一天的记忆。  \r\n\t<\/p>\r\n\r\n                    ","title":"上班族生态的经典总结","type":1,"ct":"2017-02-22 17:30:11.670"},{"id":"58ad5a236e36386e8c80ec44","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、我从一家眼镜店门口路过，门口的礼仪小姐给我递过一块眼镜布，原来是为了眼镜店做广告宣传，凡是带眼镜的同志从她门前路过，都免费发给一块精美的眼睛布。惊喜之余，我从她身旁来回走了9次，得了9块眼镜布。到了第10 次，我突然感到不好意思了，便把眼镜摘了下来，不想再要了。可正在这时小姐还是给我递过一块眼镜布，还说道：\u201c摘了眼镜，我也照样认识你。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、有个美国青年，暑假期间到中国 <p><\/p>\r\n拜了一个武术老师学习中国功夫，回国后，他在同学们面前大肆炫耀，还当起了武术师傅。 <p><\/p>\r\n这天早晨，那美国青年带着一帮同学在广场上练功，一个华人留学生站在旁边观看了很久，这时，那美国青年走过来得意地问：\u201c怎么样，我的中国功夫练得不错吧？\u201d <p><\/p>\r\n华人留学生惊奇地说：\u201c天哪，没想到你们竟这么痴迷中国的广播体操！ \u201d \r\n\t<\/p>\r\n\t<p>\r\n\t\t3、张三家被小偷光顾，在网上发了一张贴子：昨晚回家，发现被盗。我想报警，却不知110的电话是多少.知道的,请告诉一下.马上有人跟贴，好心的：我爸在公安局上班，我打电话给你问一下。<p><\/p>\r\n拍砖的:110的电话你都不知道，还想在社会混，去死吧。<p><\/p>\r\n有迠议的：110应该把他们的电话号码向大家公佈.<p><\/p>\r\n更多的跟帖问：<p><\/p>\r\n119的电话是多少?<p><\/p>\r\n120的电话是多少?<p><\/p>\r\n315的电话是多少?\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、一家三口坐在电视机前看动物世界，电视里正在播放一群狼撕分猎物的情景。女儿说：\u201c爸爸，我怕。\u201d爸爸说：\u201c女儿不怕，有妈妈呢。\u201d妈妈纳闷的想：要是真有狼来了，爸爸不是比妈妈更有力量赶走狼。爸爸接着说：\u201c你妈妈胖，她一个人就够狼吃的了，到时候爸爸就抱着女儿逃跑了。\u201d...... \r\n\t<\/p>\r\n\t<p>\r\n\t\t5、公羊：\u201c老婆，今天吃啥？\u201d<p><\/p>\r\n母羊：\u201c今天我们吃狼肉！ \u201d<p><\/p>\r\n公羊(⊙o⊙)\u201c哇，那么好啊！通常都是狼吃我们，今天我们吃狼了啊！ \u201d<p><\/p>\r\n菜上来以后，公羊吃了一口，说：\u201c怎么肉那么小，还有一股怪味啊？\u201d<p><\/p>\r\n母羊：\u201c屎壳郎肉，就是这个味道啊！ \u201d\r\n\t<\/p>\r\n\r\n                    ","title":"这些笑话有些冷","type":1,"ct":"2017-02-22 17:30:11.666"},{"id":"58ad5a236e36386e8c80ec43","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t 1、从前有两个渔夫,一个非常勤勉,天天出海打鱼,另一个则比较懒散,好几天才出海一次,但一年下来,两人的收成却差不多。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    勤勉渔夫不忍问道;\"你打鱼的次数比我少多了,怎么收成会和我的差不多呢?\"\r\n\t<\/p>\r\n\t<p>\r\n\t\t    懒散的渔夫解释道;\"你的方法不对,虽然天天出海打鱼,但有时候多,有时候少,有时遇上风浪血本无归.但我则是经常上网了解天气和渔汛的情况,做的有的放矢埃\"\r\n\t<\/p>\r\n\t<p>\r\n\t\t    勤勉的渔夫不禁戚慨;\u2018还是你强啊，三天打鱼，两天上网。\u2019\r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n    2、守株的农夫天天守在哪棵树旁，在等待下一只兔子。他等啊等啊，等了无数个日月，等到胡子都白了，也没有等到第二只兔子。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    临死前他恍然大唔;我现在终于明白了,我整日守在这里毫无收获,那是因为我没有隐身啊.\r\n\t<\/p>\r\n\r\n                    ","title":"干什么都得有门道","type":1,"ct":"2017-02-22 17:30:11.666"},{"id":"58ad5a236e36386e8c80ec42","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、一只白猫和一只黑猫一起出去散步,白猫不小心掉进阴沟里了.黑猫对白猫说了一句话.问;黑猫说了什么?\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、老王卖牛，一头牛卖2000元，为什么3头牛卖10000元？\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有一样东西，它每个月都会来一次，只是薄薄的一张纸就令你心烦意乱，这到底是什么东西呢？\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、老王去年因为骂警察是猪而被罚款一万五千元，为什么今年又骂警察是猪，却被罚了三万元？\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、一向准时的女孩在上班途中，发现被一名男子跟踪，心中暗惊，而当她赶到办公室时，竟意外地迟到了，为什么？\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、一个猎人去山上打猎,看到一只猩猩.射第一只箭被猩猩拿手抓住了,射的第二只箭又被猩猩拿手抓住了。而这时猎人已经没有箭了,但是猩猩却死了.请问猩猩是怎么死的?\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、小明上幼儿园,只会掰着手指算算术,老师问他5+5=? 他不好意思让老师看见,两手就插进裤袋里数,数了一次=11,不放心又数了一次还是11,老师叫他把手拿出来数,他数了一次才知道=10.为什么?\r\n\t<\/p>\r\n\t<p>\r\n\t\t8、古人曾将蓝色布衣浸于黄河水中，发生了什么现象？\r\n\t<\/p>\r\n\t<p>\r\n\t\t9、民、工人、军人、科学家都靠什么吃饭？\r\n\t<\/p>\r\n\t<p>\r\n\t\t10、某人从A地到B地要花一小时，回来时却要两个半小时，为什么？\r\n\t<\/p>\r\n\t<p>\r\n\t\t11、甲乙两位仇人以喝毒酒决定生死，为什么乙选了没毒的酒却死了？\r\n\t<\/p>\r\n\r\n                    ","title":"超级欠扁的脑筋急转弯","type":1,"ct":"2017-02-22 17:30:11.666"},{"id":"58ad5a236e36386e8c80ec3f","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、鼻头要有肉，鼻头有肉的男人既有欲也有财，衣食无忧；  \r\n\t<\/p>\r\n\t<p>\r\n\t\t  2、嘴唇要有肉，厚嘴唇的男人为人厚道，薄嘴唇的男人通常都很薄幸；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  3、下巴要有肉，下巴有肉，除了可以让你捏他下巴之外，他的晚年也会过得不错，可以照顾你；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  4、耳朵要有肉，耳大肥厚，是长寿的征相，他长寿，就可以和你厮守终身，最幸福的就是可以比你爱的人先死，他那么长寿你的愿望不难达成；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  5、脸颊要有肉，双颊凹陷的男人不是太可怕吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t  6、肩膀要有肉，可以让你舒舒服服的把下巴搁上去；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  7、背部要有肉，可以随时背你；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  8、胸前要有肉，可以挨得住女人几拳；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  9、手掌要有肉，手掌肥厚的男人会很富有，不用女人养他；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  10、双腿要有肉，两条枯树枝一样的腿太没有安全感；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  11、最重要的是屁股要有肉，屁股大而有肉的男人最顾家，小屁股的男人多半靠不住；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  12、他那颗心，当然也要是肉造的，只有这样，他的心才容易被你打动；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  那么。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t    找头猪准没错！   \r\n\t<\/p>\r\n\r\n                    ","title":"男人身上必须有肉的地方","type":1,"ct":"2017-02-22 17:30:11.325"},{"id":"58ad5a236e36386e8c80ec3e","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t很久很久以前，有3只乌龟，分别是黑乌龟、红乌龟和蓝乌龟，它们是很好的朋友。由于它们走得很慢,几乎没有去过什么地方，于是它们决定在有生之年，去看看山上的景色。<p><\/p>\r\n    于是，3只乌龟各自带了一碗泡面，向山顶出发了。它们花了10年的时间,终于爬到了山顶。当它们高高兴兴地拿出了准备好的泡面，想要好好地庆祝一番时，不幸的事情发生了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    它们发现自己竟然忘记了带热水！\r\n\t<\/p>\r\n\t<p>\r\n\t\t    没有了热腾腾的泡面，岂不是扫兴了?\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是黑乌龟很勇敢地站出来说：\u201c那我回去拿好了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    红乌龟和蓝乌龟说：\u201c不好吧?很远呢！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    黑乌龟说：\u201c为了我们的友谊\u2026\u2026我愿意!!\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    红乌龟和蓝乌龟说：\u201c黑兄，你实在是太够朋友了，我们一定会等你回来一起吃泡面的。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是黑乌龟出发了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    10年过去了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t    20年过去了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t    30年过去了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t    可是黑乌龟一直没有回来。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是蓝乌龟就对红乌龟说：\u201c我们已经等了30年了\u2026\u2026可是黑兄一直都没有回来，干脆我们先吃好了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    红乌龟回答说：\u201c不行。我们说好了要一起吃的。怎么可以背叛黑兄呢?\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t于是蓝乌龟很羞愧地说：\u201c是我不对\u2026\u2026那我们继续等吧！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是又过了20年，但是黑乌龟还是没有回来。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    这一天,它们终于忍不住了，蓝乌龟说：\u201c我受不了了。搞不好黑兄他自己在家里吃完后就懒得回来了。我要先吃了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是红乌龟想了想说：\u201c我真是看错他了，我也要吃了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    就当它们掀开杯盖的那一刻，黑乌龟从树的后面走了出来。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    它很生气的说：\u201c我就知道你们两个会背叛我。我已经在这里等了50年了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t \r\n\t<\/p>\r\n\t<p>\r\n\t\t    这个故事告诉我们：乌龟慢是慢了点，但是人家是很有耐心并且很长寿的。。。\r\n\t<\/p>\r\n\r\n                    ","title":"三只乌龟的笑话","type":1,"ct":"2017-02-22 17:30:11.313"},{"id":"58ad5a226e36386e8c80ec3b","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、太太要先生帮她洗碗，先生不好意思回绝，于是把十岁的儿子叫到跟前，和颜悦色的跟他说：\u201c孩子，现在让你练习洗碗，以后可以帮太太的忙。\u201d <p><\/p>\r\n儿子一脸抱怨的说：\u201c不必，以后我可以叫我儿子洗。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n2、小区新开了一家酒楼。 <p><\/p>\r\n小张说：\u201c我有这家酒楼的贵宾卡，他们给我打八折。\u201d <p><\/p>\r\n小李说：\u201c我和老板是熟人，上回他们给我打了五折。\u201d <p><\/p>\r\n小王说：\u201c我没有贵宾卡，和老板也不熟，还忘了带钱，结果吃完饭后，他们给我打了个\u2018骨折\u2019\u201d。\r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n3、男：\u201c喝酒之后，你变得更美丽了。\u201d <p><\/p>\r\n女：\u201c可是我并没有喝酒埃\u201d <p><\/p>\r\n男：\u201c我知道，但是我喝了。\u201d \r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n4、一男子像神医求救：\u201c我老婆一直抱怨我那方面的能力太差！ \u201d  <p><\/p>\r\n神医说：\u201c别担心，这瓶药可以让你重振雄风！ \u201d  <p><\/p>\r\n男子非常感动，拿着药便走了！  <p><\/p>\r\n数天后，这名男子回来复诊，他对医生说：\u201c太棒了！吃了你的药，现在我一天可以做好几次！ \u201d  <p><\/p>\r\n神医得意的说：\u201c看来你老婆一定很满意了！ \u201d  <p><\/p>\r\n男子说:\u201c不知道！从那时起我一直没空回家。\u201d  \r\n\t<\/p>\r\n\r\n                    ","title":"俺传四个冷笑话","type":1,"ct":"2017-02-22 17:30:10.562"},{"id":"58ad5a226e36386e8c80ec3a","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、和一MM相亲，茶馆里相对而坐，了解过双方的工作、教育、家庭、爱好后，交谈陷入困境， 开始扯些冷笑话，随后聊到了社会经济话题。\r\n\t<\/p>\r\n\t<p>\r\n\t\t我：你是如何看待房市的？ <p><\/p>\r\nMM：（愣了一下，低头沉默了一会儿）还是不要过于频繁比较好\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、中国人的勇敢表现在：先上，不行再撤下来。改革开放、股市、互联网、任命官员、油价、球场换人无不遵循这一原则。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一个男人问街边小姐：包夜多少钱？<p><\/p>\r\n答：200元。<p><\/p>\r\n问：是不是怎么样都行？<p><\/p>\r\n答：是！<p><\/p>\r\n男人大喜：今晚你帮我到火车站排队去！\r\n\t<\/p>\r\n\r\n                    ","title":"偶传4个冷笑话","type":1,"ct":"2017-02-22 17:30:10.547"},{"id":"58ad5a226e36386e8c80ec38","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、学校请来区里的专家给学生上性知识讲座，结果专家扯了一下午计划生育工作进展，最后为了增加趣味性捎带提到女娲造人的传说，他问道：谁知道女娲为什么要用黄土造人？台下无人响应，专家有点尴尬，就点了他面前的一个女生回答，女生小声说：是不是她不知道怎么造人？专家启发道：那她为什么不知道怎么造人呢？女生答：是不是因为听了您的讲座？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、小明上小学一年级，总是分不清声母和韵母，老师考他：\u201c耶\u201d和\u201c华\u201d的声母是哪个？小明答：\u201c生母\u201d玛丽亚。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、学校开运动会，小强的班级在入场式上集体舞了一段\u201c太极剑\u201d煞是好看、非常轰动。\u201c最佳入场式奖\u201d众望所归地给了小强他们班，校长发表讲话说：一人独剑并不难，难的是全班集体剑，还剑得那么整齐！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、Mm：老师，我有心脏病，申请不参加军训。<p><\/p>\r\n辅导员：你有校医院的证明吗？<p><\/p>\r\nMm：\u2026\u2026这还要证明？<p><\/p>\r\n辅导员：当然！除了肉眼能判断的外伤，其他的都要证明。<p><\/p>\r\nMm：好吧，我头发分叉。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、小倩去见素未谋面的网友，屡次强调两人是特别纯洁的友谊。出门半小时后小倩突然折返，小美问她为什么，小倩说：人家忘了换新内裤了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、玄奘西行前问菩萨：佛祖相貌何如？菩萨笑曰：佛无常相，但若有\u201c面如满月、光头阔口、身材丰盈、手持法宝\u201d者，必定是佛祖显圣。玄奘默默记下了，到天竺后，四处寻找有如上特征的人，果真让他找到一个，玄奘激动地上前执掌躬身道：请问尊驾可是如来佛祖？对方说：<p><\/p>\r\n私はドラえもんだ！（我是机器猫！）\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、某高校斥巨资把西南门修缮一新，意欲建设成学校的标志性建筑。在命名商讨会上校长发言说：\u201c既然是西南门，不如就取一个\u2018未\u2019字，既暗合了十二地支方位，又很雅致。\u201d与会者赞叹鼓掌，校长对自己的才智表现很满意。副校长也不甘落后，赶紧说：\u201c我校向来以交通专业见长，不如再取一个\u2018佑\u2019字，即暗合了詹天佑的名氏，又有保佑祝福之意。\u201d与会者赞叹鼓掌，副校长对自己的才智表现也很满意。党委书记心中着急，唯恐得不到重视赶紧说道：\u201c不如再取一个\u2018新\u2019字，既突出了是新校门，又有欣欣向荣之意，还很有时代感！ \u201d与会者热烈鼓掌，党委书记对自己的才智表现非常满意。一个月后新校门建成了，匾额上书四个磅礴金字：《新佑未门》(聪明的一休里的武士)\r\n\t<\/p>\r\n\t<p>\r\n\t\t8、小蚯蚓带同学去家里玩，席间同学忍不住问道：叔叔，您这一身伤疤是怎么弄的？还一圈一圈的？气氛顿时凝固，蚯蚓爸爸叹息不语。同学自知说错话了，赶紧转移话题：叔叔您喜欢足球吗？\r\n\t<\/p>\r\n\r\n                    ","title":"八个经典冷笑话","type":1,"ct":"2017-02-22 17:30:10.520"},{"id":"58ad5a226e36386e8c80ec37","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1.临考时，奉劝大家不要看不太吉利的电影，譬如《大红灯笼高高挂》\r\n\t<\/p>\r\n\t<p>\r\n\t\t2.MM回答问题时发现自己思路错误而答不下去，紧要关头一纸条悄然飞至，正当她为有人英雄救美而感动时，却发现纸条上写着--你死定了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3.某男上火车靠窗坐下，车开后利索地掏出一烧鸡，帅气地揪下鸡脑袋，很潇洒地把整个烧鸡身子嗖的扔出窗外，然后盯着手里的鸡脑袋发了一会儿呆，开始啃。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4.\u201c一张全票，一张半票。\u201d一位女乘客说。售票员注视她身旁的一个男孩片刻，说：\u201c他一定已达十二岁了，请你替他买全票。\u201d\u201c喂，我结婚才十年，他怎么可能是十二岁呢？\u201d\u201c夫人，\u201d售票员说，\u201c我只负责售票，你的私人问题恕我不想解答。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t5.\u201c谁知道，地球是什么形状的？\u201d一位山村小学正在课堂上提问。\u201c不知道，先生。\u201d同学们齐声答道。\u201c那么，我常用的那个鼻烟壶是什么形状的？\u201d\u201c四方的，先生。\u201d\u201c不，不，我的意思不是那一个，我指的是我星期天用的那个。\u201d\u201c圆的，先生。\u201d\u201c那么，现在你们明白地球是什么形状了吗？\u201d\u201c明白了，星期一到星期六是方的，星期天是圆的，是吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6.男：亲爱的，咱们结婚吧？女：结婚可以，不过你农庄里的菜得让我想偷就偷！男沉吟半天，毅然决然地摇头：想偷我的菜，没门！\r\n\t<\/p>\r\n\t<p>\r\n\t\t7.潇洒的大学生活-----身在宿舍发如草，出门帅的不得了，美女如云不用找，恋爱可以随便搞，毕业之前鸳鸯鸟，毕业之后纷飞了！\r\n\t<\/p>\r\n\r\n                    ","title":"一些经典冷笑话","type":1,"ct":"2017-02-22 17:30:10.520"},{"id":"58ad5a226e36386e8c80ec36","text":"<p>\r\n\t\t4楼的人喜欢在阳台上磨刀\r\n\t<\/p>\r\n\t<p>\r\n\t\t3楼的人喜欢在阳台上往下撒尿\r\n\t<\/p>\r\n\t<p>\r\n\t\t2楼的人喜欢把所有的东西都涂成绿色的\r\n\t<\/p>\r\n\t<p>\r\n\t\t1楼的人喜欢吃黄瓜\r\n\t<\/p>\r\n\t<p>\r\n\t\t \r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n有一天.............4楼的人磨刀的时候把刀掉下去了............\r\n\t<\/p>","title":"很囧的一个冷笑话","type":1,"ct":"2017-02-22 17:30:10.431"},{"id":"58ad54266e36386e8c80e5a3","title":"白天坐办公室里哼了两...","text":"白天坐办公室里哼了两句：今天心情好啊，老狼请吃鸡。\r\n然后感觉领导的脸黑了一整天。下班才知道，今天领导请大家吃饭。\r\n哭晕怎么没人提前告我。这饭到底要不要去吃呢？","type":1,"ct":"2017-02-22 17:04:38.662"},{"id":"58ad54266e36386e8c80e5a1","title":"朋友说：\u201c你不了解，...","text":"朋友说：\u201c你不了解，我其实是因为另一个女人而离婚的。\u201d\r\n\u201c那个女人长得很漂亮吧。\u201d\r\n\u201c不，又老又丑。是我丈母娘。\u201d","type":1,"ct":"2017-02-22 17:04:38.662"},{"id":"58ad54266e36386e8c80e574","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、汽车嫁给火车，可不久就离婚了。大家问原因，汽车伤心地说：\u201c他天天担心我被撞，我呢，时时怕他出轨，真受不了！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一猛男坐公车回家，好心的女售票员见其拉链未拉上，提醒他说：\u201c同志，你枪没放好，小心走火呀。\u201d猛男笑曰：\u201c没关系，子弹刚刚打完了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、女领导夜归，突被两男架上车，一男威胁说：\u201c老实点，劫色的。\u201d女领导闻言笑骂道：\u201c他爹的，这么愉快的事，搞得这么紧张，吓死了，我还以为被双规了！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、小仁对小洋说:我在巷口捡到了十块钱。小洋:一定是我昨天掉的那张。小仁:可是我捡到的是两张五块的！小洋:那一定是掉的时候摔破了\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、快期末了，大家一起跟我唱：\u201c我家住在黄土高坡，大风从坡上刮过，不管是李宇春还是曾轶可，都是我滴哥我滴哥 。。。我家住在黄土高坡，日头从坡上走过，不管是拜春哥，还是拜曾哥，保佑我及格，不挂科！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、打牌中，一帅哥说话中提到他哥哥，边上一女生（美女)甚惊讶,问道:\u201c你上面还有哥哥啊?\u201c 帅哥答:\u201c是碍\u201c 女生又问:\u201c那你下面有没有弟弟?\u201c \r\n\t<\/p>\r\n\r\n                    ","title":"搞笑冷笑话","type":1,"ct":"2017-02-22 17:04:38.154"}],"currentPage":1,"allNum":16213,"maxResult":20}
     */

    private int showapi_res_code;
    private String showapi_res_error;
    private ShowapiResBodyBean showapi_res_body;

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * allPages : 811
         * ret_code : 0
         * contentlist : [{"id":"58ae516e6e36386e8c845f7c","title":"\u201c你电脑里的小说是在...","text":"\u201c你电脑里的小说是在哪下载的，看着真TM带劲！\u201d\r\n\u201c那特么是我日记。\u201d","type":1,"ct":"2017-02-23 11:05:18.161"},{"id":"58ae49416e36386e8c8434e4","title":"某电视台做一期关于单...","text":"某电视台做一期关于单身节目，记者采访了一单身男\r\n记者：\u201c请问单身是什么感觉？\u201d\r\n某男：\u201c你有女朋友吗？\u201d\r\n记者：\u201c还没。\u201d\r\n某男：\u201c那你TM还问我？\u201d\r\n记者：\u201c\u2026\u2026\u201d\r\n记者：\u201c但是我有男朋友啊！\u201d\r\n某男：\u201c噢噢，那没事了\u2026\u2026\u201d","type":1,"ct":"2017-02-23 10:30:25.388"},{"id":"58ae434f6e36386e8c842c00","title":"丽丽：\u201c妈妈我是你生...","text":"丽丽：\u201c妈妈我是你生的吗？\u201d\r\n母亲：\u201c是呀，宝贝儿。\u201d\r\n丽丽：\u201c那我哥哥是谁生的呢？\u201d\r\n母亲：\u201c傻孩子，你哥哥当然也是我生的呀。\u201d\r\n丽丽：\u201c连男孩也是妈妈生的，那要爸爸有啥用呢？\u201d\r\n","type":1,"ct":"2017-02-23 10:05:03.468"},{"id":"58ae352b6e36386e8c83f663","title":"晚上和媳妇聊天，媳妇...","text":"晚上和媳妇聊天，媳妇问我：什么是真爱？\r\n我：真爱就是，我不嫌你丑，你不嫌我瞎。\r\n媳妇：哦，看老娘不打死你！！","type":1,"ct":"2017-02-23 09:04:43.031"},{"id":"58ae352b6e36386e8c83f662","title":"一男相亲，女的问他：...","text":"一男相亲，女的问他：\u201c你喜欢一见钟情呢还是日久生情呢？\u201d\r\n他说：\u201c我喜欢一炮而红的。。。。。\u201d","type":1,"ct":"2017-02-23 09:04:43.031"},{"id":"58ae27016e36386e8c83c7b7","title":"今天看到女神在线。\r...","text":"今天看到女神在线。\r\n我发了一个信息给她：\u201c在吗？\u201d\r\n十分钟后女神回道：\u201c在拉，有事吗？\u201d\r\n天哪！女神居然回复我了！\r\n我按耐住激动的心情回复：\u201c那你先拉，拉完再聊。\u201d\r\n一个小时过去了，女神怎么还没拉完？","type":1,"ct":"2017-02-23 08:04:17.523"},{"id":"58ad5a236e36386e8c80ec46","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1，一打开电视总是会碰到广告，一打起瞌睡总是遇到主管。\r\n\t<\/p>\r\n\t<p>\r\n\t\t2，选老板和选老婆一样，和你当初的梦想差了十万八千里。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3，现代人的迷思在于：你要做大公司里的小职员还是小公司里的大职员？<p><\/p>\r\n4，发财是每个上班族的梦想，发呆是每个上班族的心愿。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5，当老板告诉你退一步海阔天空的时候，你最好提防后面是不是断崖。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6，成功的男人背后一定有一个伟大的女人，成功的老板背后一定有一群倒霉的员工。\r\n\t<\/p>\r\n\t<p>\r\n\t\t7，时间就是金钱，但一个人没找到工作前，时间可一点都不值钱。\r\n\t<\/p>\r\n\t<p>\r\n\t\t8，文件是做不完的，我们的青春是会消耗完的。\r\n\t<\/p>\r\n\t<p>\r\n\t\t9，职员写日记，老板写传记.\r\n\t<\/p>\r\n\t<p>\r\n\t\t10，上天要毁灭一个人，会先让他成为上班族，然后再让他的老板把他搞疯。\r\n\t<\/p>\r\n\t<p>\r\n\t\t11，人没有办法同时赚钱又同时花钱，所以我们需要一个老婆\u2014\u2014上班族老公如是说。\r\n\t<\/p>\r\n\t<p>\r\n\t\t12，两点间最远的距离就是职员与老板对看的距离。\r\n\t<\/p>\r\n\t<p>\r\n\t\t13，天下没有愚蠢的员工，只有装傻的员工。\r\n\t<\/p>\r\n\t<p>\r\n\t\t14，在现代公司里，能者不是多劳而是脱逃。\r\n\t<\/p>\r\n\t<p>\r\n\t\t15，下班第一杯啤酒，消除你一天的紧张。下班第二杯啤酒，消除你一天的不满。下班第三杯啤酒，消除你一天的无奈。其余的啤酒，消除你一天的记忆。  \r\n\t<\/p>\r\n\r\n                    ","title":"上班族生态的经典总结","type":1,"ct":"2017-02-22 17:30:11.670"},{"id":"58ad5a236e36386e8c80ec44","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、我从一家眼镜店门口路过，门口的礼仪小姐给我递过一块眼镜布，原来是为了眼镜店做广告宣传，凡是带眼镜的同志从她门前路过，都免费发给一块精美的眼睛布。惊喜之余，我从她身旁来回走了9次，得了9块眼镜布。到了第10 次，我突然感到不好意思了，便把眼镜摘了下来，不想再要了。可正在这时小姐还是给我递过一块眼镜布，还说道：\u201c摘了眼镜，我也照样认识你。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、有个美国青年，暑假期间到中国 <p><\/p>\r\n拜了一个武术老师学习中国功夫，回国后，他在同学们面前大肆炫耀，还当起了武术师傅。 <p><\/p>\r\n这天早晨，那美国青年带着一帮同学在广场上练功，一个华人留学生站在旁边观看了很久，这时，那美国青年走过来得意地问：\u201c怎么样，我的中国功夫练得不错吧？\u201d <p><\/p>\r\n华人留学生惊奇地说：\u201c天哪，没想到你们竟这么痴迷中国的广播体操！ \u201d \r\n\t<\/p>\r\n\t<p>\r\n\t\t3、张三家被小偷光顾，在网上发了一张贴子：昨晚回家，发现被盗。我想报警，却不知110的电话是多少.知道的,请告诉一下.马上有人跟贴，好心的：我爸在公安局上班，我打电话给你问一下。<p><\/p>\r\n拍砖的:110的电话你都不知道，还想在社会混，去死吧。<p><\/p>\r\n有迠议的：110应该把他们的电话号码向大家公佈.<p><\/p>\r\n更多的跟帖问：<p><\/p>\r\n119的电话是多少?<p><\/p>\r\n120的电话是多少?<p><\/p>\r\n315的电话是多少?\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、一家三口坐在电视机前看动物世界，电视里正在播放一群狼撕分猎物的情景。女儿说：\u201c爸爸，我怕。\u201d爸爸说：\u201c女儿不怕，有妈妈呢。\u201d妈妈纳闷的想：要是真有狼来了，爸爸不是比妈妈更有力量赶走狼。爸爸接着说：\u201c你妈妈胖，她一个人就够狼吃的了，到时候爸爸就抱着女儿逃跑了。\u201d...... \r\n\t<\/p>\r\n\t<p>\r\n\t\t5、公羊：\u201c老婆，今天吃啥？\u201d<p><\/p>\r\n母羊：\u201c今天我们吃狼肉！ \u201d<p><\/p>\r\n公羊(⊙o⊙)\u201c哇，那么好啊！通常都是狼吃我们，今天我们吃狼了啊！ \u201d<p><\/p>\r\n菜上来以后，公羊吃了一口，说：\u201c怎么肉那么小，还有一股怪味啊？\u201d<p><\/p>\r\n母羊：\u201c屎壳郎肉，就是这个味道啊！ \u201d\r\n\t<\/p>\r\n\r\n                    ","title":"这些笑话有些冷","type":1,"ct":"2017-02-22 17:30:11.666"},{"id":"58ad5a236e36386e8c80ec43","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t 1、从前有两个渔夫,一个非常勤勉,天天出海打鱼,另一个则比较懒散,好几天才出海一次,但一年下来,两人的收成却差不多。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    勤勉渔夫不忍问道;\"你打鱼的次数比我少多了,怎么收成会和我的差不多呢?\"\r\n\t<\/p>\r\n\t<p>\r\n\t\t    懒散的渔夫解释道;\"你的方法不对,虽然天天出海打鱼,但有时候多,有时候少,有时遇上风浪血本无归.但我则是经常上网了解天气和渔汛的情况,做的有的放矢埃\"\r\n\t<\/p>\r\n\t<p>\r\n\t\t    勤勉的渔夫不禁戚慨;\u2018还是你强啊，三天打鱼，两天上网。\u2019\r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n    2、守株的农夫天天守在哪棵树旁，在等待下一只兔子。他等啊等啊，等了无数个日月，等到胡子都白了，也没有等到第二只兔子。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    临死前他恍然大唔;我现在终于明白了,我整日守在这里毫无收获,那是因为我没有隐身啊.\r\n\t<\/p>\r\n\r\n                    ","title":"干什么都得有门道","type":1,"ct":"2017-02-22 17:30:11.666"},{"id":"58ad5a236e36386e8c80ec42","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、一只白猫和一只黑猫一起出去散步,白猫不小心掉进阴沟里了.黑猫对白猫说了一句话.问;黑猫说了什么?\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、老王卖牛，一头牛卖2000元，为什么3头牛卖10000元？\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、有一样东西，它每个月都会来一次，只是薄薄的一张纸就令你心烦意乱，这到底是什么东西呢？\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、老王去年因为骂警察是猪而被罚款一万五千元，为什么今年又骂警察是猪，却被罚了三万元？\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、一向准时的女孩在上班途中，发现被一名男子跟踪，心中暗惊，而当她赶到办公室时，竟意外地迟到了，为什么？\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、一个猎人去山上打猎,看到一只猩猩.射第一只箭被猩猩拿手抓住了,射的第二只箭又被猩猩拿手抓住了。而这时猎人已经没有箭了,但是猩猩却死了.请问猩猩是怎么死的?\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、小明上幼儿园,只会掰着手指算算术,老师问他5+5=? 他不好意思让老师看见,两手就插进裤袋里数,数了一次=11,不放心又数了一次还是11,老师叫他把手拿出来数,他数了一次才知道=10.为什么?\r\n\t<\/p>\r\n\t<p>\r\n\t\t8、古人曾将蓝色布衣浸于黄河水中，发生了什么现象？\r\n\t<\/p>\r\n\t<p>\r\n\t\t9、民、工人、军人、科学家都靠什么吃饭？\r\n\t<\/p>\r\n\t<p>\r\n\t\t10、某人从A地到B地要花一小时，回来时却要两个半小时，为什么？\r\n\t<\/p>\r\n\t<p>\r\n\t\t11、甲乙两位仇人以喝毒酒决定生死，为什么乙选了没毒的酒却死了？\r\n\t<\/p>\r\n\r\n                    ","title":"超级欠扁的脑筋急转弯","type":1,"ct":"2017-02-22 17:30:11.666"},{"id":"58ad5a236e36386e8c80ec3f","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、鼻头要有肉，鼻头有肉的男人既有欲也有财，衣食无忧；  \r\n\t<\/p>\r\n\t<p>\r\n\t\t  2、嘴唇要有肉，厚嘴唇的男人为人厚道，薄嘴唇的男人通常都很薄幸；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  3、下巴要有肉，下巴有肉，除了可以让你捏他下巴之外，他的晚年也会过得不错，可以照顾你；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  4、耳朵要有肉，耳大肥厚，是长寿的征相，他长寿，就可以和你厮守终身，最幸福的就是可以比你爱的人先死，他那么长寿你的愿望不难达成；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  5、脸颊要有肉，双颊凹陷的男人不是太可怕吗？\r\n\t<\/p>\r\n\t<p>\r\n\t\t  6、肩膀要有肉，可以让你舒舒服服的把下巴搁上去；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  7、背部要有肉，可以随时背你；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  8、胸前要有肉，可以挨得住女人几拳；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  9、手掌要有肉，手掌肥厚的男人会很富有，不用女人养他；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  10、双腿要有肉，两条枯树枝一样的腿太没有安全感；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  11、最重要的是屁股要有肉，屁股大而有肉的男人最顾家，小屁股的男人多半靠不住；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  12、他那颗心，当然也要是肉造的，只有这样，他的心才容易被你打动；\r\n\t<\/p>\r\n\t<p>\r\n\t\t  那么。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t  。。。。。    \r\n\t<\/p>\r\n\t<p>\r\n\t\t    找头猪准没错！   \r\n\t<\/p>\r\n\r\n                    ","title":"男人身上必须有肉的地方","type":1,"ct":"2017-02-22 17:30:11.325"},{"id":"58ad5a236e36386e8c80ec3e","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t很久很久以前，有3只乌龟，分别是黑乌龟、红乌龟和蓝乌龟，它们是很好的朋友。由于它们走得很慢,几乎没有去过什么地方，于是它们决定在有生之年，去看看山上的景色。<p><\/p>\r\n    于是，3只乌龟各自带了一碗泡面，向山顶出发了。它们花了10年的时间,终于爬到了山顶。当它们高高兴兴地拿出了准备好的泡面，想要好好地庆祝一番时，不幸的事情发生了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    它们发现自己竟然忘记了带热水！\r\n\t<\/p>\r\n\t<p>\r\n\t\t    没有了热腾腾的泡面，岂不是扫兴了?\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是黑乌龟很勇敢地站出来说：\u201c那我回去拿好了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    红乌龟和蓝乌龟说：\u201c不好吧?很远呢！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    黑乌龟说：\u201c为了我们的友谊\u2026\u2026我愿意!!\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    红乌龟和蓝乌龟说：\u201c黑兄，你实在是太够朋友了，我们一定会等你回来一起吃泡面的。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是黑乌龟出发了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    10年过去了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t    20年过去了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t    30年过去了\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t    可是黑乌龟一直没有回来。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是蓝乌龟就对红乌龟说：\u201c我们已经等了30年了\u2026\u2026可是黑兄一直都没有回来，干脆我们先吃好了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    红乌龟回答说：\u201c不行。我们说好了要一起吃的。怎么可以背叛黑兄呢?\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t于是蓝乌龟很羞愧地说：\u201c是我不对\u2026\u2026那我们继续等吧！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是又过了20年，但是黑乌龟还是没有回来。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    这一天,它们终于忍不住了，蓝乌龟说：\u201c我受不了了。搞不好黑兄他自己在家里吃完后就懒得回来了。我要先吃了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    于是红乌龟想了想说：\u201c我真是看错他了，我也要吃了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t    就当它们掀开杯盖的那一刻，黑乌龟从树的后面走了出来。\r\n\t<\/p>\r\n\t<p>\r\n\t\t    它很生气的说：\u201c我就知道你们两个会背叛我。我已经在这里等了50年了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t \r\n\t<\/p>\r\n\t<p>\r\n\t\t    这个故事告诉我们：乌龟慢是慢了点，但是人家是很有耐心并且很长寿的。。。\r\n\t<\/p>\r\n\r\n                    ","title":"三只乌龟的笑话","type":1,"ct":"2017-02-22 17:30:11.313"},{"id":"58ad5a226e36386e8c80ec3b","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、太太要先生帮她洗碗，先生不好意思回绝，于是把十岁的儿子叫到跟前，和颜悦色的跟他说：\u201c孩子，现在让你练习洗碗，以后可以帮太太的忙。\u201d <p><\/p>\r\n儿子一脸抱怨的说：\u201c不必，以后我可以叫我儿子洗。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n2、小区新开了一家酒楼。 <p><\/p>\r\n小张说：\u201c我有这家酒楼的贵宾卡，他们给我打八折。\u201d <p><\/p>\r\n小李说：\u201c我和老板是熟人，上回他们给我打了五折。\u201d <p><\/p>\r\n小王说：\u201c我没有贵宾卡，和老板也不熟，还忘了带钱，结果吃完饭后，他们给我打了个\u2018骨折\u2019\u201d。\r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n3、男：\u201c喝酒之后，你变得更美丽了。\u201d <p><\/p>\r\n女：\u201c可是我并没有喝酒埃\u201d <p><\/p>\r\n男：\u201c我知道，但是我喝了。\u201d \r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n4、一男子像神医求救：\u201c我老婆一直抱怨我那方面的能力太差！ \u201d  <p><\/p>\r\n神医说：\u201c别担心，这瓶药可以让你重振雄风！ \u201d  <p><\/p>\r\n男子非常感动，拿着药便走了！  <p><\/p>\r\n数天后，这名男子回来复诊，他对医生说：\u201c太棒了！吃了你的药，现在我一天可以做好几次！ \u201d  <p><\/p>\r\n神医得意的说：\u201c看来你老婆一定很满意了！ \u201d  <p><\/p>\r\n男子说:\u201c不知道！从那时起我一直没空回家。\u201d  \r\n\t<\/p>\r\n\r\n                    ","title":"俺传四个冷笑话","type":1,"ct":"2017-02-22 17:30:10.562"},{"id":"58ad5a226e36386e8c80ec3a","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、和一MM相亲，茶馆里相对而坐，了解过双方的工作、教育、家庭、爱好后，交谈陷入困境， 开始扯些冷笑话，随后聊到了社会经济话题。\r\n\t<\/p>\r\n\t<p>\r\n\t\t我：你是如何看待房市的？ <p><\/p>\r\nMM：（愣了一下，低头沉默了一会儿）还是不要过于频繁比较好\u2026\u2026\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、中国人的勇敢表现在：先上，不行再撤下来。改革开放、股市、互联网、任命官员、油价、球场换人无不遵循这一原则。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、一个男人问街边小姐：包夜多少钱？<p><\/p>\r\n答：200元。<p><\/p>\r\n问：是不是怎么样都行？<p><\/p>\r\n答：是！<p><\/p>\r\n男人大喜：今晚你帮我到火车站排队去！\r\n\t<\/p>\r\n\r\n                    ","title":"偶传4个冷笑话","type":1,"ct":"2017-02-22 17:30:10.547"},{"id":"58ad5a226e36386e8c80ec38","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、学校请来区里的专家给学生上性知识讲座，结果专家扯了一下午计划生育工作进展，最后为了增加趣味性捎带提到女娲造人的传说，他问道：谁知道女娲为什么要用黄土造人？台下无人响应，专家有点尴尬，就点了他面前的一个女生回答，女生小声说：是不是她不知道怎么造人？专家启发道：那她为什么不知道怎么造人呢？女生答：是不是因为听了您的讲座？\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、小明上小学一年级，总是分不清声母和韵母，老师考他：\u201c耶\u201d和\u201c华\u201d的声母是哪个？小明答：\u201c生母\u201d玛丽亚。\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、学校开运动会，小强的班级在入场式上集体舞了一段\u201c太极剑\u201d煞是好看、非常轰动。\u201c最佳入场式奖\u201d众望所归地给了小强他们班，校长发表讲话说：一人独剑并不难，难的是全班集体剑，还剑得那么整齐！\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、Mm：老师，我有心脏病，申请不参加军训。<p><\/p>\r\n辅导员：你有校医院的证明吗？<p><\/p>\r\nMm：\u2026\u2026这还要证明？<p><\/p>\r\n辅导员：当然！除了肉眼能判断的外伤，其他的都要证明。<p><\/p>\r\nMm：好吧，我头发分叉。\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、小倩去见素未谋面的网友，屡次强调两人是特别纯洁的友谊。出门半小时后小倩突然折返，小美问她为什么，小倩说：人家忘了换新内裤了。\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、玄奘西行前问菩萨：佛祖相貌何如？菩萨笑曰：佛无常相，但若有\u201c面如满月、光头阔口、身材丰盈、手持法宝\u201d者，必定是佛祖显圣。玄奘默默记下了，到天竺后，四处寻找有如上特征的人，果真让他找到一个，玄奘激动地上前执掌躬身道：请问尊驾可是如来佛祖？对方说：<p><\/p>\r\n私はドラえもんだ！（我是机器猫！）\r\n\t<\/p>\r\n\t<p>\r\n\t\t7、某高校斥巨资把西南门修缮一新，意欲建设成学校的标志性建筑。在命名商讨会上校长发言说：\u201c既然是西南门，不如就取一个\u2018未\u2019字，既暗合了十二地支方位，又很雅致。\u201d与会者赞叹鼓掌，校长对自己的才智表现很满意。副校长也不甘落后，赶紧说：\u201c我校向来以交通专业见长，不如再取一个\u2018佑\u2019字，即暗合了詹天佑的名氏，又有保佑祝福之意。\u201d与会者赞叹鼓掌，副校长对自己的才智表现也很满意。党委书记心中着急，唯恐得不到重视赶紧说道：\u201c不如再取一个\u2018新\u2019字，既突出了是新校门，又有欣欣向荣之意，还很有时代感！ \u201d与会者热烈鼓掌，党委书记对自己的才智表现非常满意。一个月后新校门建成了，匾额上书四个磅礴金字：《新佑未门》(聪明的一休里的武士)\r\n\t<\/p>\r\n\t<p>\r\n\t\t8、小蚯蚓带同学去家里玩，席间同学忍不住问道：叔叔，您这一身伤疤是怎么弄的？还一圈一圈的？气氛顿时凝固，蚯蚓爸爸叹息不语。同学自知说错话了，赶紧转移话题：叔叔您喜欢足球吗？\r\n\t<\/p>\r\n\r\n                    ","title":"八个经典冷笑话","type":1,"ct":"2017-02-22 17:30:10.520"},{"id":"58ad5a226e36386e8c80ec37","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1.临考时，奉劝大家不要看不太吉利的电影，譬如《大红灯笼高高挂》\r\n\t<\/p>\r\n\t<p>\r\n\t\t2.MM回答问题时发现自己思路错误而答不下去，紧要关头一纸条悄然飞至，正当她为有人英雄救美而感动时，却发现纸条上写着--你死定了！\r\n\t<\/p>\r\n\t<p>\r\n\t\t3.某男上火车靠窗坐下，车开后利索地掏出一烧鸡，帅气地揪下鸡脑袋，很潇洒地把整个烧鸡身子嗖的扔出窗外，然后盯着手里的鸡脑袋发了一会儿呆，开始啃。\r\n\t<\/p>\r\n\t<p>\r\n\t\t4.\u201c一张全票，一张半票。\u201d一位女乘客说。售票员注视她身旁的一个男孩片刻，说：\u201c他一定已达十二岁了，请你替他买全票。\u201d\u201c喂，我结婚才十年，他怎么可能是十二岁呢？\u201d\u201c夫人，\u201d售票员说，\u201c我只负责售票，你的私人问题恕我不想解答。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t5.\u201c谁知道，地球是什么形状的？\u201d一位山村小学正在课堂上提问。\u201c不知道，先生。\u201d同学们齐声答道。\u201c那么，我常用的那个鼻烟壶是什么形状的？\u201d\u201c四方的，先生。\u201d\u201c不，不，我的意思不是那一个，我指的是我星期天用的那个。\u201d\u201c圆的，先生。\u201d\u201c那么，现在你们明白地球是什么形状了吗？\u201d\u201c明白了，星期一到星期六是方的，星期天是圆的，是吗？\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6.男：亲爱的，咱们结婚吧？女：结婚可以，不过你农庄里的菜得让我想偷就偷！男沉吟半天，毅然决然地摇头：想偷我的菜，没门！\r\n\t<\/p>\r\n\t<p>\r\n\t\t7.潇洒的大学生活-----身在宿舍发如草，出门帅的不得了，美女如云不用找，恋爱可以随便搞，毕业之前鸳鸯鸟，毕业之后纷飞了！\r\n\t<\/p>\r\n\r\n                    ","title":"一些经典冷笑话","type":1,"ct":"2017-02-22 17:30:10.520"},{"id":"58ad5a226e36386e8c80ec36","text":"<p>\r\n\t\t4楼的人喜欢在阳台上磨刀\r\n\t<\/p>\r\n\t<p>\r\n\t\t3楼的人喜欢在阳台上往下撒尿\r\n\t<\/p>\r\n\t<p>\r\n\t\t2楼的人喜欢把所有的东西都涂成绿色的\r\n\t<\/p>\r\n\t<p>\r\n\t\t1楼的人喜欢吃黄瓜\r\n\t<\/p>\r\n\t<p>\r\n\t\t \r\n\t<\/p>\r\n\t<p>\r\n\t\t<p><\/p>\r\n有一天.............4楼的人磨刀的时候把刀掉下去了............\r\n\t<\/p>","title":"很囧的一个冷笑话","type":1,"ct":"2017-02-22 17:30:10.431"},{"id":"58ad54266e36386e8c80e5a3","title":"白天坐办公室里哼了两...","text":"白天坐办公室里哼了两句：今天心情好啊，老狼请吃鸡。\r\n然后感觉领导的脸黑了一整天。下班才知道，今天领导请大家吃饭。\r\n哭晕怎么没人提前告我。这饭到底要不要去吃呢？","type":1,"ct":"2017-02-22 17:04:38.662"},{"id":"58ad54266e36386e8c80e5a1","title":"朋友说：\u201c你不了解，...","text":"朋友说：\u201c你不了解，我其实是因为另一个女人而离婚的。\u201d\r\n\u201c那个女人长得很漂亮吧。\u201d\r\n\u201c不，又老又丑。是我丈母娘。\u201d","type":1,"ct":"2017-02-22 17:04:38.662"},{"id":"58ad54266e36386e8c80e574","text":" \n                        \r\n\t\r\n\t<p>\r\n\t\t1、汽车嫁给火车，可不久就离婚了。大家问原因，汽车伤心地说：\u201c他天天担心我被撞，我呢，时时怕他出轨，真受不了！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t2、一猛男坐公车回家，好心的女售票员见其拉链未拉上，提醒他说：\u201c同志，你枪没放好，小心走火呀。\u201d猛男笑曰：\u201c没关系，子弹刚刚打完了。\u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t3、女领导夜归，突被两男架上车，一男威胁说：\u201c老实点，劫色的。\u201d女领导闻言笑骂道：\u201c他爹的，这么愉快的事，搞得这么紧张，吓死了，我还以为被双规了！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t4、小仁对小洋说:我在巷口捡到了十块钱。小洋:一定是我昨天掉的那张。小仁:可是我捡到的是两张五块的！小洋:那一定是掉的时候摔破了\r\n\t<\/p>\r\n\t<p>\r\n\t\t5、快期末了，大家一起跟我唱：\u201c我家住在黄土高坡，大风从坡上刮过，不管是李宇春还是曾轶可，都是我滴哥我滴哥 。。。我家住在黄土高坡，日头从坡上走过，不管是拜春哥，还是拜曾哥，保佑我及格，不挂科！ \u201d\r\n\t<\/p>\r\n\t<p>\r\n\t\t6、打牌中，一帅哥说话中提到他哥哥，边上一女生（美女)甚惊讶,问道:\u201c你上面还有哥哥啊?\u201c 帅哥答:\u201c是碍\u201c 女生又问:\u201c那你下面有没有弟弟?\u201c \r\n\t<\/p>\r\n\r\n                    ","title":"搞笑冷笑话","type":1,"ct":"2017-02-22 17:04:38.154"}]
         * currentPage : 1
         * allNum : 16213
         * maxResult : 20
         */

        private int allPages;
        private int ret_code;
        private int currentPage;
        private int allNum;
        private int maxResult;
        private List<ContentlistBean> contentlist;

        public int getAllPages() {
            return allPages;
        }

        public void setAllPages(int allPages) {
            this.allPages = allPages;
        }

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public int getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(int currentPage) {
            this.currentPage = currentPage;
        }

        public int getAllNum() {
            return allNum;
        }

        public void setAllNum(int allNum) {
            this.allNum = allNum;
        }

        public int getMaxResult() {
            return maxResult;
        }

        public void setMaxResult(int maxResult) {
            this.maxResult = maxResult;
        }

        public List<ContentlistBean> getContentlist() {
            return contentlist;
        }

        public void setContentlist(List<ContentlistBean> contentlist) {
            this.contentlist = contentlist;
        }

        public static class ContentlistBean {
            /**
             * id : 58ae516e6e36386e8c845f7c
             * title : “你电脑里的小说是在...
             * text : “你电脑里的小说是在哪下载的，看着真TM带劲！”
             “那特么是我日记。”
             * type : 1
             * ct : 2017-02-23 11:05:18.161
             */

            private String id;
            private String title;
            private String text;
            private int type;
            private String ct;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            public String getText() {
                return text;
            }

            public void setText(String text) {
                this.text = text;
            }

            public int getType() {
                return type;
            }

            public void setType(int type) {
                this.type = type;
            }

            public String getCt() {
                return ct;
            }

            public void setCt(String ct) {
                this.ct = ct;
            }

            @Override
            public String toString() {
                return "ContentlistBean{" +
                        "ct='" + ct + '\'' +
                        ", id='" + id + '\'' +
                        ", title='" + title + '\'' +
                        ", text='" + text + '\'' +
                        ", type=" + type +
                        '}';
            }
        }

        @Override
        public String toString() {
            return "ShowapiResBodyBean{" +
                    "allNum=" + allNum +
                    ", allPages=" + allPages +
                    ", ret_code=" + ret_code +
                    ", currentPage=" + currentPage +
                    ", maxResult=" + maxResult +
                    ", contentlist=" + contentlist +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "JokeText{" +
                "showapi_res_body=" + showapi_res_body +
                ", showapi_res_code=" + showapi_res_code +
                ", showapi_res_error='" + showapi_res_error + '\'' +
                '}';
    }
}
